# Taps
tap "dagger/tap"
tap "jesseduffield/lazydocker"
tap "spacelift-io/spacelift"
tap "nats-io/nats-tools"

# Brew tools
# NOTE: Order matters for nats stuff. first te tap and then the brew commands
brew "jesseduffield/lazydocker/lazydocker"
brew "nats-io/nats-tools/nats"
brew "nats-io/nats-tools/nsc"
brew "spacelift-io/spacelift/spacectl"
brew "act" # runs GHA locally
brew "argocd"
brew "git"
brew "asdf"
brew "bat"
brew "cmake"
brew "kubernetes-cli"
brew "devspace"
brew "dive"
brew "snappy"
brew "eza"
brew "ffmpeg"
brew "fzf"
brew "gh"
brew "gitmoji"
brew "grpcurl"
brew "helm"
brew "httpie"
brew "istioctl"
brew "jless"
brew "jq"
brew "k9s"
brew "krew"
brew "kubecolor"
brew "kubectx"
brew "kustomize"
brew "minikube"
brew "nvm"
brew "pint" # prometheus linter
brew "pipx" # like a python cli good to install poetry
brew "protobuf"
brew "pyenv"
brew "rbenv"
brew "redis"
brew "ripgrep"
brew "stern"
brew "swagger-codegen"
brew "talosctl"
brew "terraform"
brew "thefuck"
brew "tmux"
brew "uv"
brew "watchman"
brew "xh"
brew "yq"
brew "dagger/tap/dagger"
brew "awscli"
brew "temporal"
brew "granted" # check the official web, this one up

# Casks - Apps
cask "alt-tab"
cask "caffeine"
cask "devtoys"
cask "ghostty"
cask "insomnia"
cask "iterm2"
cask "mongodb-compass"
cask "orbstack" # lightweight docker tool
cask "podman-desktop"
cask "postman"
cask "rectangle"
cask "redis-insight"
cask "warp"
cask "gcloud-cli"
cask "dbeaver-community"
cask "raycast"

# VSCode extensions
vscode "aaron-bond.better-comments"
vscode "adpyke.codesnap"
vscode "amazonwebservices.aws-toolkit-vscode"
vscode "apollographql.vscode-apollo"
vscode "bierner.markdown-preview-github-styles"
vscode "bradlc.vscode-tailwindcss"
vscode "cardinal90.multi-cursor-case-preserve"
vscode "chakrounanas.turbo-console-log"
vscode "charliermarsh.ruff"
vscode "chrmarti.regex"
vscode "coderabbit.coderabbit-vscode"
vscode "codezombiech.gitignore"
vscode "codium.codium"
vscode "dbaeumer.vscode-eslint"
vscode "donjayamanne.githistory"
vscode "dsznajder.es7-react-js-snippets"
vscode "dzhavat.css-flexbox-cheatsheet"
vscode "eamodio.gitlens"
vscode "ecmel.vscode-html-css"
vscode "esbenp.prettier-vscode"
vscode "fill-labs.dependi"
vscode "formulahendry.auto-rename-tag"
vscode "formulahendry.code-runner"
vscode "github.codespaces"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "github.vscode-github-actions"
vscode "github.vscode-pull-request-github"
vscode "golang.go"
vscode "grapecity.gc-excelviewer"
vscode "graphql.vscode-graphql"
vscode "graphql.vscode-graphql-syntax"
vscode "gruntfuggly.activitusbar"
vscode "gruntfuggly.todo-tree"
vscode "hashicorp.terraform"
vscode "hediet.vscode-drawio"
vscode "humao.rest-client"
vscode "hwencc.html-tag-wrapper"
vscode "infeng.vscode-react-typescript"
vscode "jebbs.plantuml"
vscode "jrebocho.vscode-random"
vscode "kisstkondoros.vscode-gutter-preview"
vscode "letmaik.git-tree-compare"
vscode "mattpocock.ts-error-translator"
vscode "me-dutour-mathieu.vscode-github-actions"
vscode "meganrogge.template-string-converter"
vscode "mguellsegarra.highlight-on-copy"
vscode "mhutchie.git-graph"
vscode "miguelsolorio.fluent-icons"
vscode "miguelsolorio.symbols"
vscode "mikestead.dotenv"
vscode "mintlify.document"
vscode "mohsen1.prettify-json"
vscode "mongodb.mongodb-vscode"
vscode "ms-azuretools.vscode-containers"
vscode "ms-azuretools.vscode-docker"
vscode "ms-kubernetes-tools.vscode-kubernetes-tools"
vscode "ms-python.autopep8"
vscode "ms-python.debugpy"
vscode "ms-python.isort"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-python.vscode-python-envs"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode.live-server"
vscode "ms-vscode.makefile-tools"
vscode "msjsdiag.vscode-react-native"
vscode "naumovs.color-highlight"
vscode "ohansemmanuel.css-grid-snippets"
vscode "orta.vscode-jest"
vscode "oxc.oxc-vscode"
vscode "pflannery.vscode-versionlens"
vscode "postman.postman-for-vscode"
vscode "pranaygp.vscode-css-peek"
vscode "prisma.prisma"
vscode "rangav.vscode-thunder-client"
vscode "rapidapi.vscode-rapidapi-client"
vscode "rapidapi.vscode-services"
vscode "redhat.vscode-yaml"
vscode "ritwickdey.liveserver"
vscode "rodrigovallades.es7-react-js-snippets"
vscode "rust-lang.rust-analyzer"
vscode "sanjulaganepola.github-local-actions"
vscode "sdras.vue-vscode-snippets"
vscode "sporiley.css-auto-prefix"
vscode "streetsidesoftware.code-spell-checker"
vscode "tamasfe.even-better-toml"
vscode "techer.open-in-browser"
vscode "tomoki1207.pdf"
vscode "usernamehw.errorlens"
vscode "vincaslt.highlight-matching-tag"
vscode "vivaxy.vscode-conventional-commits"
vscode "vue.volar"
vscode "wallabyjs.quokka-vscode"
vscode "wayou.vscode-todo-highlight"
vscode "william-voyek.vscode-nginx"
vscode "wix.vscode-import-cost"
vscode "xabikos.javascriptsnippets"
vscode "yoavbls.pretty-ts-errors"
vscode "zainchen.json"
vscode "zignd.html-css-class-completion"
vscode "zxh404.vscode-proto3"
