# Taps
tap "nats-io/nats-tools"

# Brew tools
# NOTE: Order matters for nats stuff. first te tap and then the brew commands
brew "nats-io/nats-tools/nats"
brew "nats-io/nats-tools/nsc"
brew "git"
brew "asdf"
brew "bat"
brew "cmake"
brew "snappy"
brew "eza"
brew "ffmpeg"
brew "fzf"
brew "gh"
brew "gitmoji"
brew "httpie"
brew "jless"
brew "jq"
brew "kubernetes-cli"
brew "k9s"
brew "krew"
brew "kubecolor"
brew "kubectx"
brew "kustomize"
brew "minikube"
brew "nvm"
brew "pint" # prometheus linter
brew "protobuf"
brew "pyenv"
brew "rbenv"
brew "redis"
brew "stern"
brew "talosctl"
brew "terraform"
brew "thefuck"
brew "tmux"
brew "uv"
brew "watchman"
brew "xh"


# Casks - Apps
cask "alt-tab"
cask "devtoys"
cask "ghostty"
cask "iterm2"
cask "podman-desktop"
cask "postman"
cask "redis-insight"
cask "warp"
